Autodesk.Revit.DB.IFC.ImporterIFC.HybridCreateImportMap(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Creates a map to look up Element Ids, given an IFCGuid as input.
doc:
Document containing Elements
elementIds:
ElementIds that are candidates for association.
Returns:
Returns Map to retrieve ElementIds that correspond to specific IFCGuids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.IFC.ImporterIFC.HybridElementImport(Autodesk.Revit.DB.Document,System.String)
Imports IFC Elements using non-open-source framework.
doc:
Document into which Import is done.
file:
Full path of the file to import.
Returns:
Elements imported using non-open-source framework.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024